DataProcessors/РасчетИндексацииЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>РасчетИндексацииЗадолженности</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Займ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийДоговор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВыданногоЗайма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачиЗайма</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентнаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьПроцентнойСтавки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПогашения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрограммаРасчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьСрокаЗайма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПроцентнойСтавки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПогашения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРешения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Территория</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапитализацияПроцентов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереноситьОплатыНаНачалоМесяца</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсключитьКрайниеМесяцы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсторияПлатежей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежа</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГрафикИндексации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НачалоПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонецПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проценты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дни</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИПЦ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КУплате</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстаткиОсновнойДолг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстаткиПроценты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОплатаОсновнойДолг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОплатаПроценты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Переплата</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстаткиПроцентыЗаВесьПериод</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ИсторияПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ИсторияПлатежей</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Задолженность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидДвиженияЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидДвиженияЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

DataProcessors/РасчетИндексацииЗадолженности/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура РассчитатьГрафикНаСервере()
	//ЗначениеОбъект = РеквизитФормыВЗначение("Объект");
	//ЗначениеОбъект.ЗагрузитьГрафикНачислений();
	//ЗначениеВРеквизитФормы(ЗначениеОбъект, "Объект");
	
	Объект.ГрафикИндексации.Загрузить(РасчетЗадолженностиСудопроизводство.РассчитатьГрафикИндексации(Объект, Объект.ИсторияПлатежей.Выгрузить()));
	
	к = Объект.ГрафикИндексации.Количество();
	Если к > 0 Тогда
		Элементы.ГрафикНачисленияИПогашенияКУплате.ТекстПодвала = Строка(Объект.ГрафикИндексации[к-1].Куплате);
		Элементы.ГрафикНачисленияИПогашенияОстаткиОсновнойДолг.ТекстПодвала = Строка(Объект.ГрафикИндексации[к-1].ОстаткиОсновнойДолг);
		Элементы.ГрафикНачисленияИПогашенияОстаткиПроценты.ТекстПодвала = Строка(Объект.ГрафикИндексации[к-1].ОстаткиПроценты);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьГрафик(Команда)
	Если Не ЗначениеЗаполнено(Объект.ДатаРешения) Тогда
		Сообщить("Заполните дату решения!");
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.СуммаЗадолженности) Тогда
		Сообщить("Заполните сумму решения!");
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.ДатаРасчета) Тогда
		Сообщить("Заполните дату расчета!");
		Возврат;
	КонецЕсли;	
	РассчитатьГрафикНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Объект.ДатаВыдачиЗайма = ТекущаяДата();
	//Объект.ДатаДоговора = ТекущаяДата();
	//Объект.ДатаПогашения = ТекущаяДата() + 10*24*3600;
	//Объект.ДатаРасчета = ТекущаяДата() + 20*24*3600;
	//Объект.СуммаВыданногоЗайма = 10000;
	//Объект.ПроцентнаяСтавка = 1;
	Объект.ДатаРасчета = ТекущаяДатаСеанса();
	//Объект.ДатаРешения = Дата("20190115");
	//Объект.СуммаЗадолженности = 100000; 
	Объект.КапитализацияПроцентов = Истина;
	Объект.ПереноситьОплатыНаНачалоМесяца = Истина;
	Объект.ИсключитьКрайниеМесяцы = Истина;
	Объект.Территория = "Свердловская область";


КонецПроцедуры


&НаСервере
Процедура ЗаймПриИзмененииНаСервере()
	//Объект.ДатаВыдачиЗайма = ОбъектыСервер.ПолучитьЗначениеСвойства(Объект.Займ,"0046     ");
	//Объект.ДатаДоговора = ОбъектыСервер.ПолучитьЗначениеСвойства(Объект.Займ,"0046     ");
	//Объект.ДатаПогашения = ОбъектыСервер.ПолучитьЗначениеСвойства(Объект.Займ,"0047     ");
	//Объект.ДатаРасчета = ТекущаяДата();
	//Объект.СуммаВыданногоЗайма = ОбъектыСервер.ПолучитьЗначениеСвойства(Объект.Займ,"0048     ");
	//Объект.ПроцентнаяСтавка = ОбъектыСервер.ПолучитьЗначениеСвойства(Объект.Займ,"0045     ");
	//
	//Объект.ОстаткиДата = ОбъектыСервер.ПолучитьЗначениеСвойства(Объект.Займ,"0043     ");
	//Объект.ДниПросрочки = ОбъектыСервер.ПолучитьЗначениеСвойства(Объект.Займ,"0069     ");
	//ЗаполнитьОстатки(Объект.Займ);

	// Вставить содержимое обработчика.
	
	//ЗначениеОбъект = РеквизитФормыВЗначение("Объект");
	//ЗначениеОбъект.ЗаполнитьДанные();
	//ЗначениеВРеквизитФормы(ЗначениеОбъект, "Объект");
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ИсторияПлатежей.Период КАК ДатаПлатежа,
	                      |	ИсторияПлатежей.Задолженность КАК СуммаПлатежа
	                      |ИЗ
	                      |	РегистрНакопления.ИсторияПлатежей КАК ИсторияПлатежей
	                      |ГДЕ
	                      |	ИсторияПлатежей.Объект = &Объект");
	Запрос.УстановитьПараметр("Объект", Объект.Займ);
	Результат = Запрос.Выполнить().Выгрузить();
	Объект.ИсторияПлатежей.Загрузить(Результат);
КонецПроцедуры

&НаКлиенте
Процедура ЗаймПриИзменении(Элемент)
//	Объект.СуммаЗадолженности = ЭтаФорма.ВладелецФормы.Объект.ЦенаИска;
//	Объект.ДатаРешения = НачалоДня(ЭтаФорма.ВладелецФормы.Объект.Дата);
	ЗаймПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОстатки(ДО)
	//Запрос = Новый Запрос();
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ЗадолженностьПоОбъектамОстатки.ОсновнойДолгДООстаток КАК ОсновнойДолгДООстаток,
	//               |	ЗадолженностьПоОбъектамОстатки.ПроцентыДООстаток КАК ПроцентыДООстаток,
	//               |	ЗадолженностьПоОбъектамОстатки.ШтрафыДООстаток КАК ШтрафыДООстаток
	//               |ИЗ
	//               |	РегистрНакопления.ЗадолженностьПоОбъектам.Остатки КАК ЗадолженностьПоОбъектамОстатки
	//               |ГДЕ
	//               |	ЗадолженностьПоОбъектамОстатки.Объект = &Объект";
	//Запрос.УстановитьПараметр("Объект",ДО);
	//Рез = Запрос.Выполнить().Выбрать();
	//Пока Рез.Следующий() Цикл
	//	Объект.ОстаткиОД = Рез.ОсновнойДолгДООстаток;
	//	Объект.ОстаткиПросроченныеПроценты = Рез.ШтрафыДООстаток;
	//	Объект.ОстаткиПроценты = Рез.ПроцентыДООстаток;
	//КонецЦикла;	
	
КонецПроцедуры


&НаСервере
Процедура ПриОткрытииНаСервере()
	//Объект.ДатаРасчета = НачалоДня(ТекущаяДата());
	//Объект.ТекущийДоговор = РасчетЗадолженностиМФО.ПолучитьТекущийДоговор(Объект.Займ, НачалоДня(ТекущаяДата()));
	//Список = РасчетЗадолженностиМФО.СписокРеквизитовДоговорМикрозайма();
	//Для Каждого Реквизит Из Список Цикл
	//	Попытка
	//		Объект[Реквизит] = Объект.ТекущийДоговор[Реквизит];
	//	Исключение
	//		
	//	КонецПопытки;
	//КонецЦикла;
	//Объект.ИсторияПлатежей.Загрузить(РасчетЗадолженностиМФО.ПолучитьИсториюПлатежей(Объект.ТекущийДоговор));
	Объект.ИсторияПлатежей.Сортировать("ДатаПлатежа");
	Если ЗначениеЗаполнено(Объект.Займ) Тогда
		ЗаймПриИзмененииНаСервере();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаймПриИзменении(Неопределено);
	ПриОткрытииНаСервере();
КонецПроцедуры
